name: "mpnet_model"
platform: "pytorch_libtorch"
max_batch_size: 16

input [
  {
    name: "input_ids"
    data_type: TYPE_INT64
    dims: [128]
  },
  {
    name: "attention_mask"
    data_type: TYPE_INT64
    dims: [128]
  }
]

output [
  {
    name: "output__0"
    data_type: TYPE_FP32
    dims: [768]
  }
]

instance_group [
  {
    kind: KIND_GPU
    count: 1
  }
]
